In [2]:
import pandas as pd
import numpy as np

In [16]:
s1 = pd.Series([0,1,2,3], index = ['a','b','c','d'])
s2 = pd.Series([4,5,6], index = ['c','d','e'])
s1

a    0
b    1
c    2
d    3
dtype: int64

In [17]:
s2

c    4
d    5
e    6
dtype: int64

In [13]:
s3 = pd.concat([s1,s2],keys=["one","two"])
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [19]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [26]:
df5 = pd.DataFrame(np.arange(6).reshape(2,3),index=["Seoul","Busan"],columns=["one","two","three"])
df5.index.name = "city"
df5.columns.name = "number"

In [28]:
df5 = df5.unstack()

In [40]:
df6 = pd.DataFrame({"left":df5, "right":df5+5}, columns = {"left","right"})
df6.columns.name = "side"
df6

side          left  right
number city
one    Seoul     0      5
       Busan     3      8
two    Seoul     1      6
       Busan     4      9
three  Seoul     2      7
       Busan     5     10

In [39]:
df6.unstack(level = "city").stack(level="side")

city          Busan  Seoul
number side
one    left       3      0
       right      8      5
two    left       4      1
       right      9      6
three  left       5      2
       right     10      7

# 중복값의 검사와제거#

In [43]:
df = pd.DataFrame({'k1':['one']*3+['Two']*4,'k2':[1,1,2,3,3,4,4,]})
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  Two   3
4  Two   3
5  Two   4
6  Two   4

중복값 검사하기

In [45]:
df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

중복값 제거하기

In [47]:
df.drop_duplicates() #위의 결과 중 false 인 결과의 튜플만을 반환

    k1  k2
0  one   1
2  one   2
3  Two   3
5  Two   4

In [51]:
df["v1"]=np.arange(7)
df

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  Two   3   3
4  Two   3   4
5  Two   4   5
6  Two   4   6

In [53]:
df.drop_duplicates(["k1"]) #k1 키 값을 기준으로 중복된 행들을 모두 제거

    k1  k2  v1
0  one   1   0
3  Two   3   3

In [56]:
df.drop_duplicates(["k1","k2"],keep="last") #마지막에 발견된 행만을 반환
#last 대신 first 를 넣을 수 있다. 그러면 중복된 값들 중 처음 값을 반환한다.

    k1  k2  v1
1  one   1   1
2  one   2   2
4  Two   3   4
6  Two   4   6

In [63]:
df.drop_duplicates(["k1","k2"],keep="first")

    k1  k2  v1
0  one   1   0
2  one   2   2
3  Two   3   3
5  Two   4   5

replace()

In [66]:
s = pd.Series([1.,-999.,2.,-999.,-1000.,2.])

data mapping

In [72]:
s2=s.replace(-999,np.nan) #-999 의 값을 NaN 으로 처리
s2

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       2.0
dtype: float64

In [74]:
s2.replace(np.nan,0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       2.0
dtype: float64

In [77]:
s2.fillna(0)

0       1.0
1       0.0
2       2.0
3       0.0
4   -1000.0
5       2.0
dtype: float64